// Завдання 1
// Написати розв’язок нижче описаного завдання (по одному рядку коду на кожний пункт)
// Створіть змінну city з типом даних string.
// Присвойте їй значення «Київ».
// Змініть значення змінної city на «Львів».
// Створіть змінну address з типом даних string і скопіюйте в неї значення змінної city.
// Вивести значення змінної address з допомогою команди console.log().
let city;
city = 'Kyiv';
city = 'Lviv';
let address = `${city}`;
// console.log(address);
// ------------------------------------------------------------------------------------------
// Завдання 2
// Використовуючи конструкцію if..else через тернарний вираз, напишіть код, який отримує число через prompt, а потім виводить в console.log() повідомлення:
// Число парне.
// Число непарне.
// Число 0.
// 
let a = +prompt('Number');
a != 0 ? a % 2 > 0 ? console.log('not parne') : console.log('parne') : console.log(a);
// ------------------------------------------------------------------------------------------
// Завдання 3
// Написати розв’язок нижче описаного завдання за допомогою function declaration:
// Потрібно створити функцію, яка повертає максимальний переданий їй числовий параметр.
// Кількість параметрів у функції може бути від 2х і більше.
// Приклад роботи:
// max(5,-2) – має повернути 5.
// max(5,-2, 30, 6) – має повернути 30
function max(a, b, ...c) {
    return Math.max(...arguments);
}
console.log(max(5, -2));
console.log(max(5, -2, 30, 6, 1000, 1001));
// ------------------------------------------------------------------------------------------Завдання 4
// Напишіть функцію getSqrt(number), яка вираховує корінь квадратний. Для визначення кореня використовуйте Math. В залежності від того що передали в функцію має виводити наступні повідомлення:
// Якщо передане число повертати - Квадратний корінь з стільки то дорівнює стільки то.
// Якщо передали не число - Повинно бути числове значення.
// Якщо число менше 0 - Введіть додатнє число.
// Якщо в функцію нічого не передали - Будь ласка, введіть число!
function getSqrt(number) {
    if (number == null) {
        console.log('Write a number');
    }
    else {
        if (number * 1 == number) {
            if (number >= 0) {
                console.log(Math.sqrt(number));
            }
            else {
                console.log('Write a number > 0');
            }
        }
        else {
            console.log('Need a number');
        }
    }
}
getSqrt(0);
getSqrt('a');
getSqrt(null);
getSqrt(4);
getSqrt(5);
getSqrt(-5);
// ------------------------------------------------------------------------------------------Завдання 5
// Необхідно відтворити функціонал як на відео Cenzor, а саме:
// При кліку на ADD добавляти заборонене слово, яке відображатиметься в списку “Bad words”
// Якщо поле для добавлення слова не заповнене виводити відповідне повідомлення
// При кліку на Cenzor перевіряється чи є в textarea заборонене слово, якщо так його заміняє на *, причому на ту кількість яка довжина слова
// Якщо textarea порожня виводити повыдолення про заповнення поля
